{"/blog/":{"data":{"":"Welcome to the blog. Here you’ll find the latest updates and articles."},"title":"Blog"},"/blog/2015-first-blog-post/":{"data":{"":"This is my first post! I don’t have anything particularly interesting to post at the moment so here’s some puppies"},"title":"My first blog post"},"/blog/2015-viruses-paper-published/":{"data":{"":"A paper I helped with during my time in the Fremont lab (where I rotated for 3 months) just got published! It’s introducing a new structural domain (Poxvirus Immune Evasion, or PIE) used in immune system evasion, and the evolutionary tree connecting each type of PIE protein.\nYou can check it out here"},"title":"Viruses paper published"},"/blog/2016-ten-lessons/":{"data":{"":"Science is a cruel mistress, especially when you first start your life as a research trainee. However the skills and “scar tissue” gained can be useful. In the last 6 months following my qualifying exam, some of the tricks I picked up while preparing for it have come in handy, and I’ve even picked up a few more since then. Here they all are in a nice and catchy “Top 10” format, in no specific order. Some of them might seem obvious, but it can be surprising how often the obvious things get overlooked in science.\nIf you think of a cool new idea, there’s a 95% chance it’s already been published. This is a good thing, it means you’re on the right track, and now you can follow the trail of those who came before you The principle of elimination is a powerful tool. Don’t just think of experiments to support your model, think of experiments that eliminate other possibilities. There are more applicable experimental methods out there than one might realize. For any scientific question, it can be easier to find techniques to probe the question than to come up with possible hypotheses. Always think about what the output of your method means. Every method has limitations in how you can interpret the data. Even if your data supports your hypothesis, some methods may convolute or wash out the other rare possibilities, and you could miss some really interesting stuff. If you feel like you’ve hit a wall, pace and percolate. Just get up and walk away for a little while. Don’t just write in the passive voice. This is a personal one for me because I feel like so much of my science education beat into me that the only way to write about science was in the passive voice. I’ve come to realize that it really depends on the type of writeup, the audience, and your topic. Your voice can change depending on what you’re writing. Be flexible. Speaking of flexibility - be flexible with your focus. Some directions will not work, and other directions, while interesting, may have more cost than benefit. Write all your cool ideas down for later, and aim for the lower hanging fruits first. Focus your time on building the pieces that will help your current story, and be ready for that story to change day to day. It will never hurt to cite more people. Collect textbooks, both old and new, from any and all fields. If you have friends in different fields, talk to each other about projects and ideas. Sometimes a different perspective can kickstart a whole new project. This list might get updated as time goes on, and it may not be “10 things” after a while, but these serve as a nice reminder of the simple things that can help."},"title":"10 things I learned about science"},"/blog/2017-bps-takeaways/":{"data":{"":"Last week I had a fun time in NOLA (New Orleans) at the Biophysical Society Annual Meeting! It was my first big conference and it was absolutely fabulous to see so much new and exciting work done from all kinds of different fields/approaches. It kinda got me even more excited about biophysics - it felt like there were so many things that biophysical theory can be applicable to, from cancer to small peptide design, all the way to material engineering!\nWith so many topics out there, I thought I’d highlight some of the really cool/exciting directions that biophysicists seem to be going in:\nPhase transitions. Turns out membraneless organelles and phase separation via biomolecules are more and more prevalent than anybody ever thought. Only now are we even starting to see connections to disease states, and maybe soon we’ll start seeing even more biomedical relevance! Thanks to work by Ashutosh Chilkoti at Duke , we can even engineer phase transitioning peptides! For more information about membraneless organelles, Tanja Mittag at St. Jude has done a lot of ground breaking work showing biomedical and disease implications. Membrane proteins. Everyone’s working on it. Everyone’s excited about it, and thanks to how far we’ve come with modern techniques, we’re finally approaching the point where we can try and obtain large amounts of membrane proteins for all kinds of studies. Who knows, with the combination of modern tools and machine learning (cough Bil Clemons cough), we may get to the point someday where expressing membrane proteins is as easy as soluble ones! In particular, Ion Channels are getting even more attention than before, and there were a few great talks on G-Protein Coupled Receptors from the MacCammon lab! On a more fundamental physics stage - there was some significant discussion on the role of dispersion energies and their role in getting more accurate force fields and more atomic molecular simulations. As a reminder: non-bonded atom energies are split into electrostatics and van Der Waals (vdw) interactions. The vdw term is often represented by the Lennard-Jones potential: $$V(r) = 4\\varepsilon \\left[ \\left( \\frac{\\sigma}{r} \\right)^{12} - \\left( \\frac{\\sigma}{r} \\right)^{6} \\right]$$\nwhere:\n$V(r)$ is the potential energy as a function of the distance $r$ between the particles. $\\varepsilon$ is the depth of the potential well. $\\sigma$ is the finite distance at which the inter-particle potential is zero. $r$ is the distance between the particles. The σ6 represents the attractive forces between atoms, also known as the dispersion term. And by tweaking that many people have managed to reparameterize force fields to better capture bulk solvent properties (like Osmotic Potential), but also a force field better able to capture both folded and Intrinsically disordered proteins. Personally, I sometimes am unable to distinguish if this is done out of convenience (because it’s a single uncomplicated parameter) or if there is also some physical insight behind why the dispersion terms need fixing. Either way, I’m excited to see where future work goes!\nThere are tons, tons of software packages out there to analyze MD Simulations (outside of MDTraj), and the best part is that many of them are available for free and in Python for the scientific community to use. I haven’t had a chance to play with them all yet, but they all bring something new to the proverbial tool belt of a computational biophysicist: MDAnalysis ProDy There are far too many to discuss, but many people have generated cool new ways to look at networks of communication within protein dynamics, and understand allosteric communication and its effects (I’m particularly excited about these, seeing as they are incredibly relevant and supplementary to my own work!) "},"title":"Biophysical Society 2017 Takeaways"},"/blog/2017-cards-paper/":{"data":{"":"After a decent amount of revision: the CARDS paper has officially been accepted!!!\nIf anybody is interested in reading it, they can check it out here. Now the fun comes! I’m excited to start applying all kinds of fun analyses to structure+disordered states, as well as testing CARDS on all kinds of new systems.\nIf you’re reading this and are interested in using CARDS, shoot me an email or a message somewhere and we can get that ball rolling! I’m always excited to see what patterns CARDS can find!\nAlong with CARDS, I’ve also been lucky enough to help out on a number of projects that are currently being written up, or have come out recently! One is a project from my undergrad, but other papers are more relevant to my current work. One applies docking models to rationalize differences in inhibitor activity, and another is a combination of structural biology, functional assays, and molecular dynamics to elucidate the mechanism of allostery in an Apoptosis Inducing Factor.\nIn light of finally having both a first author publication AND other papers as a contributing author, I also decided to go ahead and make my Google Scholar profile public!\nHere’s to more biophysical fun in the future!"},"title":"CARDS paper published!"},"/blog/2017-creative-venture/":{"data":{"":"So before I dive into the main subject of this post, I figured it might be time for a couple of personal updates:\nI’m a fourth year now! Holy cow! Time is certainly flying. I got to help out on a project with Tim Wencewicz’s group studying how Wildfire Toxin (AKA Tabtoxinine-β-Lactam) inhibits bacterial glutamine synthetase, opening new doors for antibiotic design! The paper was recently accepted in Biochemistry. So with that out of the way:\nI found myself doing a bit of introspection lately, and I began to ponder how science is inarguably a creative venture - there’s an inherent creativity to observing phenomena and following that thread to ask and answer new questions about the universe. I don’t want to draw too many obvious parallels to how artists do the same with society, since that would be waxing poetic a bit too strongly, so I’ll leave that as an exercise to the reader.\nHowever, like any creative venture, science can take a drain. At some point it’s important to recognize when you’re not able to ask questions or see the patterns in data that you would normally catch. Of course not recognizing that and pushing yourself further is how burnout happens, which is an oft-discussed problem in science. Self-care is important!\nSelf-care can come in many forms, be it sports or sometimes just Netflix-binging, or any combination thereof. In my case, I enjoy gaming, both video and tabletop games. Specifically, I play “Dungeons and Dragons” (this should surprise nobody). And it was in thinking about D\u0026D that I began to appreciate it’s impact on me as a scientist.\nI started off playing D\u0026D with my friends in college, and while we still play occasionally, I’ve also started playing as Game Master (or Dungeon Master) for a group here in St. Louis. Being a GM is a wholly different creative ball-game, one that has had a huge impact on me. A GM is a world-builder and represents the whole universe for their players. You have to design the world, the enemy, the characters, and the conflicts. You have to think about the rules of the game, and make sure your players don’t go on a power-trip but experience a storyline. In your own way, you get to be your own story-teller, but without all the “editing of prose”. As a bonus: You don’t have to do all the creative thinking! Your players will try and do things that you never thought would be a good idea; By a roll of the dice they will succeed or fail, leading to further hilarity and spectacular story-building that you can leap off.\nYes, being a GM gives me break from science, and it provides a bit of escapism that is sorely needed nowadays (cough Trump cough), but it’s done more than that for me as a scientist. Having to move from one creative venture to another as a break is fun! It gives you a chance to engage in something that requires your attention and creative thinking, but carries none of the weight or pressure of academia/deadlines/science. You just get to build a world that’s fun for a small group of people to interact with. By playing in this little creative playground of yours, you still get to keep those creative juices flowing, and you’ve tackled a “problem” in your own way(Namely, how do I tell my characters the story of X). Afterwards, you can return to the scientific problem you’ve been tackling with a fresh mind, but you don’t have to warm up any creative juices since you were already in that mode.\nAlong with just keeping that creativity fresh and alive, it’s made me a more confident presenter. A GM is a story-teller, and someone who has to present situations, describe conflicts, and do a bit of amateur voice acting. To do that means you have to be able to construct a narrative, figure out the most important details for your players to retain, and then present it in a manner that they understand (Basically, “knowing your audience”). These skills are inherently transferable to making a scientific presentation!\nBut above all else, I just think D\u0026D is freaking fun. There’s something inherently fun about sitting around with a small group of friends over some drinks and doing a bit of “group story telling”. You don’t even have awkward silences, since the adventure always goes on! I’m not going to go into how having this other network outside of science is a bonus, but I do want to highlight again how playing D\u0026D, or really dabbling in any creative venture, is a great bonus for a scientist, since in your own fun way you’re keeping those creative juices flowing and becoming a better presenter for it, even while taking a break!\nAt this point I think I’ve espoused enough about the values of a creative hobby. Your venture doesn’t have to be D\u0026D, nor does it have to be something big or something you do every day(I mean sometimes we just have to binge Netflix and turn your brain off). But keep in mind, we all used to play pretend growing up as a kid, isn’t it fun to be able to still do it for small doses at a time?"},"title":"The Value of a Creative Hobby"},"/blog/2017-gibbs/":{"data":{"":"So this is long past overdue, but I wanted to write up some thoughts I had on Gibbs 2017, and how much fun it was to attend!! Attending a smaller conference like Gibbs always incredibly fun, not only are you getting a chance to see the same people again and reconnect, but it is a lot easier to bug faculty and try and improve your own visibility!\nSo anyways, without further ado, here is a very abridged list of my Gibbs 2017 highlights:\nI got to chair the session on “Binding Equilibria and Allostery”! I had no idea what to expect, but it actually turned out to be really fun! There were some great talks by Sarah Bondos and others highlighting how Liquid-Liquid Phase Separation (LLPS) has a bigger role to play in biology biophysics than we might have thought previously. Carlos Castañeda presented some really interesting work looking at phase separation and the role it can play in oligomerization and Alzheimer’s disease! Sarah Bondos’ also highlighted an important reminder: That sometimes science comes from unexpected things. She told a great story how she only noticed fibril formation and LLPS because she left a drop hanging from her column overnight!! Sometimes we just have to keep our eyes open on the small things we do! "},"title":"Gibbs 2017 Takeaways"},"/blog/2018-bps-summary/":{"data":{"":"With another Biophysical Society meeting over, I can’t help but bask in reflection at all the glorious science I got to see. More and more, biophysics is bridging the gap between basic science and translational research, where back-to-back speakers can be discussing a novel protein that nobody yet understands, followed by a speaker applying physical methods and imaging to better identify cells and tumors!\nReposting this image again because it’s so applicable: In reflection, I wanted to post some thoughts/takeaways I had:\nPhase separation is still an exciting new phenomena we don’t understand. It still boggles my mind to this day that molecules inside our cells undergo Liquid-Liquid Phase Separation (LLPS) behavior. What struck me the most is that we are not just seeing where they are important for function (à la la stress granules and the nucleolus) but also how LLPS can be a sign that something is broken. Simon Alberti presented excellent work showing how ALS mutations in certain FUS family proteins result in LLPS, which over long timescales could act as nucleation points for fibril formation normally associated with the disease. There’s so much more to learn about this fascinating phenomena and it’s importance to biology!\nLipids remain a mystery. I attended the “Lipid modified GTPases” symposium as a newcomer to the role of lipids in G protein signalling, and I am in awe of the role lipids can play in enhancing signalling sensitivity, and in lipid heterogeneity! There are so many emergent properties of lipid bilayers we don’t fully understand yet that it feels like there is a bit of a Gold Rush happening right now; No matter where we turn we are discovering some new critical aspect of lipids. They aren’t just important for “compartmentalization” but rather play important roles in regulating behavior and dynamics of signaling proteins!\nOn a humorous personal note: I saw my qualifying exam project! At the Washington University biophysics program, our qualifying exam consists of an “off-topic” oral presentation given on a subject not related to our thesis project (designed this way so our lab cannot just walk us through the qual with their expertise). I presented mine on using XFELs and powerful x-rays to study metalloenzymes and the redox cycle they undergo when carrying out electron/proton transport. Dr. Junko Yano at Lawrence Berkeley national lab presented an awesome symposium talk with that exact approach to study photosystem II! She took it even a step further showing that not only can XFELs be used to study the redox cycle of metal binding sites of enzymes, but with modern engineering advances, she also collected diffraction patterns at each of these redox states. That means we can both know the redox state of a metal, and observe what the metal binding site looks like! With that kind of insight, Dr. Yano was able to start understanding the transport “channel” inside of a protein and which residues may play a role!\nThere are so many other methods and findings I’m excited about, but for the sake of brevity and not writing a book chapter, I’ll stop at 3."},"title":"Biophysical Society 2018 takeaways"},"/blog/2018-signaling-in-action/":{"data":{"":"","combining-powerful-computational-methods-let-us-observe-gdp-release-using-unbiased-simulations#Combining powerful computational methods let us observe GDP release using unbiased simulations:":"Simulations act as a “computational microscope,” capturing how Gα moves and changes shape. However, they can be computationally intensive, and so capturing a process that takes milliseconds like GDP unbinding can be difficult. In fact, GDP release is such a slow process that modeling it has never been done before!\nBy combining a myriad of computational approaches, we were able to model GDP release. We used a variant of “adaptive seeding”, where we ran biased simulations using a methodology named “Metadynamics” that pushed GDP out of it’s binding pocket. These Metadynamics simulations, while observing GDP unbinding, are biased simulations, and so we cannot extract mechanistic information easily from these simulations. What we CAN do is seed unbiased simulations from these biased simulations (like in our workflow below).\nThis effort was made possible through the generous donations of citizen scientists through the Folding@home distributed computing platform, who volunteered to run simulations on their personal computers. Their collective contributions generated data on Gα that would have taken approximately 150 years to collect on a typical desktop computer.\nWorkflow of modeling GDP release using \"adaptive seeding\". Starting from the top left, we use Metadynamics to run biased simulations where we push GDP out of the bound state. We then take these simulations and pick states along them (dots on arrows) to seed unbiased MD simulations, which we then stitched together into a Markov state model. ","introduction-and-significance#Introduction and Significance":"To communicate and respond to our environment (i.e. via vision, smell, or taste), our cells rely on signaling cascades made up of groups of proteins that activate and deactivate one another, much like a circuit.\nMany cascades in our body involve heterotrimeric G proteins, which have three components named G-alpha (Gα), G-beta (Gβ), and G-gamma (Gγ). Gα is a critical member of this trio, acting as a switch that turns on upon receiving a signal from a membrane protein receptor. This switch-like behavior of Gα is critical for life; both overactive and under-active Gα proteins have been linked to cancer, heart disease, and other disorders. However, no current therapies target Gα, despite the fact that roughly 40% of drugs on the market target other components of G-protein signaling cascades.\nStructural view of G protein signaling. a heterotrimeric G protein inside the cell (bottom) bound to the well known G protein coupled receptor (GPCR, orange). Understanding the structural changes governing the switch-like behavior of Gα would shed light into how signals are transmitted within our cells. When Gα is off, it is bound to the small molecule Guanosine diphosphate (GDP). To turn on, Gα must release GDP to bind Guanosine triphosphate (GTP). However, the details of GDP release from Gα, the critical step of Gα activation, remain unclear. This is the focus of our paper - what atomic motions and molecular changes drive GDP release during the process of Gα activation?\nStructure of Gα labelled. GDP (lime green) binds between the two domains. ","our-model-of-gdp-release-unified-decades-of-literature-research#Our model of GDP release unified decades of literature research:":"By focusing analysis to secondary structure elements and residues that are shared across all Gα homologs, this model likely captures a universal ‘skeleton’ of changes involved in Gαq activation, expanding upon a previously proposed universal mechanism for Gαq activation. The consistency of this model with a wide variety of structural and biochemical data suggests that it is a promising foundation for future efforts to understand the determinants of GPCR-Gαq interaction specificity, how mutations cause aberrant signaling and disease, and how small molecule inhibitors modulate Gαq activation.\nChanges in the allosteric network of Gαq drive GDP release. Structure of the the ras-like domain of Gαq while bound to GDP (blue) and after its rate-limiting step of GDP release (orange). Major structural changes are marked using labelled arrows, and communication from the GPCR-binding region to GDP binding site is marked using dashed arrows. ","tldr#TL;DR:":" Image with Captions and Markdown TL;DR: Our paper in eLife modeling G protein activation is out! Check it out here\nA brief summary of our paper was also published as an eLife digest!"},"title":"Signaling in action"},"/blog/2024-my-dissertation/":{"data":{"":"This page links to all the available copies of my PhD Dissertation! My full thesis itself is available in multiple forms! My complete dissertation is available online (in a scrollable/navigable form) at https://sukritsingh.github.io/thesis. You can also reach it by clicking the buttons below\nOnline HTML version PDF version I’m super happy (and lucky) that all the main thesis chapters (except for Introduction and Conclusion) of my thesis are available as published works (either in journals or as preprints for now).\nIf you are interested in the papers themselves that these thesis chapters come from, here are some links: Chapter 2: Singh and Bowman, JCTC, 2017\nChapter 3: Sun and Singh, et al., eLife, 2018\nChapter 4: Cruz and Frederick, et al., 2020\nChapter 5: Cubuk et al, Biorxiv, 2020\nChapter 6: Zimmerman et al, Biorxiv, 2020\nChapter 7: Brown et al, JBC, 2020"},"title":"My Dissertation!"},"/blog/2024-update-post/":{"data":{"":"","awards#Awards":"Thanks to the massive help and support of my co-mentors John and Markus, I was able to secure independent funding for the first time in the form of a couple of fellowships!\nThe 2024 National Cancer Institute (NCI) Pathway to Independence Award for Outstanding Early Stage Postdoctoral Researchers: this transition to independence award gives me some independent funding to complete my postdoctoral training and will award me a larger sum of money upon starting my own independent grant funding! The wild part of this application process was that each institution was only allowed to nominate one person. In other words I had to first win an internal competition followed by the full competition.\nThe 2022 Damon Runyon Quantitative Biology Fellowship: This 2022 award was the a huge support for me obtaining independent funding in the future (including the K99 award above!) It focuses on awarding quantitative biologists and computational-oriented folks like me a chance at getting hybrid training in wet-lab an dry-lab biology.\nI was also lucky enough not only to present my work at the NCI Junior Investigators meeting in 2023, I was also awarded Best Talk! This one was particularly fun for me as it was my first time presenting to a room full of folks who come from very diverse cancer-oriented backgrounds.","miscellaneous-ones-listed-here#Miscellaneous ones listed here":" I’m still involved in the social media of Folding@home, albeit less so nowadays due to other priorities\nI’ve now become one of the maintainers for MDTraj, a repository for analyzing large molecular dynamics simulation datasets at scale.\nLastly, I spent a bit of time thinking about how to better embed trajectories into HTML, and with the help of Hugo MacDermott-Opeskin I was lucky enough to be able to achieve this goal! Minimal_molview is a library that allows one to embed interactive protein visualizations into webpages by generating the protein in an HTML format. A sample is below:","papers#Papers":"I’ve contributed to quite a few works over the last couple of years (check out my Google Scholar if you’re interested), but the big highlight is that I’ve been lucky enough to publish my first co-corresponding author paper! This was work driven by superstar graduate student Ivy Zhang who helped drive and develop code to do Free Energy Calculations on mutations, as well as parsing how we can assess sampling within this mutations.\nIdentifying and overcoming the sampling challenges in relative binding free energy calculations of a model protein:protein complex., J. Chem. Theory Comput., July 2023 The other highlight was that I was the lead computational author in a study where we identified and mechanistically parsed drug-resistant mutations in the leukemia target Menin. This work was particularly exciting to me as it served as a proof of concept for many of the tools and ideas I am excited about further developing:\nMEN1 mutations mediate clinical resistance to Menin inhibition. Nature, 2023 ","tldr-ill-be-going-on-the-faculty-job-search-in-the-fall#TLDR: I\u0026rsquo;ll be going on the faculty job search in the fall!":"Now that it’s 2024 I realized I should probably sit down and write out some life updates and what is going on! This will just be a set of updates on what I’ve been up to professionally in the last few years:\nTLDR: I’ll be going on the faculty job search in the fall! Let me know if you know anybody hiring, and feel free to check out my research! Stay tuned for more papers, work, and updates!"},"title":"2024 Update Post"},"/gaming/":{"data":{"":"","my-reviews-and-thoughts#My reviews and thoughts:":"One of my big hobbies, along with D\u0026D, is playing video games and thinking about game design. Every so often I might post a review here about a game I particularly enjoyed (or didn’t).\nYou’re welcome to check out my Steam or Xbox Live profiles, but I mostly play on PC hardware.\nSometimes, to help raise awareness, a few friends and I will stream our game nights on the Folding@home twitch stream. We are affiliate status, so you can donate to the F@h research efforts, and all your donations/subs will go directly towards supporting science!\nWhat am I playing right now: Game Status Another Crab’s Treasure Completed (Coming soon!) Divinity Original Sin 2 In progress Elden Ring In progress Hades 2 In progress Baldur’s Gate 3 Completed and Playing (Coming Soon) My reviews and thoughts: Divinity: Original Sin2 - Live thoughts Divinity: Original Sin Mass Effect: Andromeda ","what-am-i-playing-right-now#What am I playing right now:":""},"title":"Gaming"},"/gaming/divinity-original-sin-2/":{"data":{"":"","there-are-no-words#there are no words.":" Image with Captions and Markdown there are no words. I loved the first game, and this game has already gotten me hooked within 2 hours. The narration, dialogue, writing, and the combat. My god(s) the combat.\nSince there’s plenty more to go, and so much to say, for now I’m just going to keep updating this post with my thoughts/experiences.\nFor anybody curious: I am playing it cooperatively with my friend online, using Red Prince and Fane as our characters (and Lohse and Beast as companions, respectively).\nCAREFUL. POTENTIAL SPOILERS BELOW.\nHoly cow 8 well written origin stories! This is the first time I’ve seen mention of the Bansuri (a flute from the Indian subcontinent) ever outside of south asian circles. Like. Ever. Props to Larian for highlighting some really diverse instruments in the soundtrack selection menu. Magisters, y’all need to chill. There’s too much allegory here with modern political times and extremist stereotyping. AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH (Also I'm not sorry) I AM THE WINNER OF THE FORT JOY ARENA. Wait why don’t our Source collars all get to come off at once?? I don’t know whether to be frustrated or impressed at sheer number of permutations to achieve objectives. Okay, from the second fight onwards we’ve had to establish a rule to not rush into everything separately. There’s so much to experience. Also these fights are TOUGH. DUAL WANDS BABY. Me using fire spells that set Beast on fire because he's 0.1 m too close to the enemy Awwww this dog on the beach is looking for his master. :( Oh no we found his master and she’s been converted into an abomination. This is some FMA levels of heartstring tugging :( LOHSE NO DO NOT KILL THE NICE NPC. I DON’T CARE THAT YOU’VE GOT A DEMON POSSESSING YOU. RED PRINCE MADE OUT WITH A LITERAL GODDESS. SCORE. LIZARDS GOT GAME. This meme, but also for spell Attribute requirements "},"title":"Live thoughts - Divinity Original Sin 2"},"/gaming/divinity-original-sin/":{"data":{"":"","combat-is-where-dos-really-stands-out#Combat is where D:OS really stands out.":" Image with Captions and Markdown Divinity: Original Sin by far one of the most challenging, varied, and fun games I have played in a long time. It combines the best of many RPGs - challenging, complicated turn-based combat and the excitement and stunning visuals of action-adventure games. I won’t spoil any plot - but suffice it to say that the plot escalates in scale very quickly. D:OS is set in the land of Rivellon (like previous Divinity games) where magic, monsters, and everything in between reside. However, along with magic, there is a corrupt semi-divine-energy called Source that many wicked folks use: These wicked folk are called Sourcerers (har har). You play as a Source Hunter - a guild of folk dedicated to dealing with Sourcery (har har). Starting in the small coastal city of Cyseal, you investigate the murder of a city council member. However, not everything is as it seems and very quickly you become embroiled in cults, conspiracies, and plot threads of cosmic, world-ending proportions.\nYou thought Marvel's Infinity War was the most ambitious crossover in history? What about Geralt the Witcher as a Source Hunter. D:OS lets you experience the chaos with a friend. While the world-ending threat level might be a familiar trope for many experienced RPGers, one thing D:OS does to set itself apart is that it gives you two protagonists to create and customize. You are able to control both of them in terms of skills, dialogue and combat - along with two other NPC companions. This gives you a whole new layer of options, mechanics, and playstyles to mix and match as you explore and fight your way around Rivellon. Furthermore, there are an immense number of options, items, skills, and powers to learn. A lack of preset builds means you can mix and match any combination of skills, stats, and abilities as you wish. However, it would behoove you to complement the two protagonists skills and abilities (ie. One tank and one mage, or one tank and one archer). This will give you more options in combat, preventing yourself being caught in a corner that you can’t get out of (and believe me, there are plenty of opportunities already to make your encounters harder without handicapping yourself with limited options).\nAlong with giving you two protagonists, the developers included a co-op mode. You and your co-op buddy each take one of the two protagonists and build them however you each wish. Of course, while you will have to work together in combat and dungeon crawls (whether you like it or not, really), you’re welcome to disagree on how you want to roleplay or make choices. You can settle your differences over a healthy game of Rock, Paper, Scissors (best of 5, but winner decides how things go down if there’s disagreement). Along with some semi-friendly RPS, you and your friend will have “dual dialogues” between the protagonists where you can express thoughts/concerns over recent events and happenings. Be careful what you say though - your responses/comments will provide you “trait points” which can provide useful bonuses suiting your character.\nCombat is where D:OS really stands out.Terrain, like high ground or wet puddles, actually makes a difference, and being able to leverage your surroundings adds new depth to the combat that I had never experienced before. Moving barrels and carts around the fighting area and destroying them as needed to create cover is just one of many things you can do with your environment. You can even blanket the ground under your enemies with elemental traps and obstacles. Facing a lot of enemy archers? Just throw an oil barrel (yes, throw, but you need a strong character) and drop in a fireball - the resulting smoke cloud will blind enemy archers and prevent them from firing at you. Fights are challenging, and D:OS does not do any sort of hand holding when it comes to figuring out which combination of elements work. It gives players the opportunities and openings throughout the game to discover mechanics by yourself. I cannot recommend enough to explore the elemental combinations any time you can - D:OS is a game where knowledge is power, and tactical know-how can change an incredibly difficult encounter to something that ends satisfyingly quickly, because you came prepared.\nMy coop buddy and I utlilized the \"You distract and I'll become a stealth bush\" more than we probably should have. ","divinity-original-sin#Divinity: Original Sin":"","dos-is-an-onion#D:OS is an onion.":"It’s got a lot of layers you won’t find unless you explore, there are a lot of different ways to handle it, and there will be some tears (both from combat frustration and lamenting over the consequences of some of your choices). It is a brutal, unforgiving game that leads you through an ultimately delicious and rewarding journey, and there is a distinct sense of victory and satisfaction when you complete the game. You can probably play through it casually without much thinking, but then you would miss out on the various hidden gems this game has to offer. It takes a tongue-in-cheek story with fantasy tropes and cosmic scale and weaves it into an original, surprisingly refreshing plot where stakes feel real. The combat is fresh, dynamic, and forces the players to strategize. Chaos and fun alike are doubled when you play with a friend. It stands unrelenting and proud in it’s complexity and rich detail, particularly in an age of gaming where many games settle for walking their players through all their mechanics. Divinity: Original Sin is truly one of a kind, and sets a high bar for any RPG I’ll be playing in the future.","dos-lets-you-experience-the-chaos-with-a-friend#D:OS lets you experience the chaos with a friend.":""},"title":"Review - Divinity Original Sin"},"/gaming/me-andromeda/":{"data":{"":"Confession time: I never finished ME: Andromeda. I just couldn’t bring myself to do it.\nThe truth is that there wasn’t enough to keep me going within the game. The plot didn’t make me feel connected to many characters, it felt too much like the standard Bioware fare. Nothing felt unique or relatable to Ryder. The environments weren’t “interesting” to explore, and I felt like I was just playing Dragon Age Inquisition: Space edition. It wasn’t so much that I actively stopped playing the game, as I just found better games to play…and with the whole “new trilogy” put on ice, there’s just no incentive to keep playing to find out what happens next…\nSo I haven’t written anything about this one yet, because I’m still playing it, but as I go along I’ll jot down thoughts I have as I go along. I’ll put spoiler warnings wherever I mention one.\nA little disappointed by the character creator - Why can’t my Ryder have long hair if he’s male? Why does the female Ryder HAVE to have a ponytail? I feel like they didn’t include many options for hair/beards.\nWait your dad sounds like Lex Luthor from DC’s Justice League animated Series! OH WAIT IT IS HIM\nNot sure how I feel yet about increased fluidity in the combat system. It’s a ton of fun to zip around the field, but not being able to snap to cover feels like it adds an unnecessary challenge to the gameplay. It’s not easier for me to be hit now - the dodge button makes me flit incredibly fast and makes it easier in fact to not be hit, but its disorienting.\nI love the new class/point assignment system. I don’t feel locked into a single class anymore, but I am still clearly building towards something very powerful and highly specialized (p.s. VANGUARDS FTW- they’re still incredibly powerful)\nSpoiler warning The entire “ancient tech” stuff just feels very Halo-esque. Like at any point I’m expecting either a bunch of monks to start singing, or to turn into the Master Chief…."},"title":"Review - Mass Effect Andromeda"},"/research/":{"data":{"1-parse-molecular-mechanisms-of-treatment-resistance-susceptibility-and-selectivity-upon-mutation#1. Parse molecular mechanisms of treatment resistance, susceptibility, and selectivity upon mutation":"","2-predict-how-protein-mutations-alter-conformational-ensembles-using-physics-based-models#2. Predict how protein mutations alter conformational ensembles using physics-based models":"","3-using-distributed-computing-and-ml-based-approaches-to-efficiently-generate-and-evaluate-datasets-describing-protein-ensembles#3. Using distributed computing and ML-based approaches to efficiently generate and evaluate datasets describing protein ensembles":"Building towards physics-based biomarker identificationI study how mutations can biophysically impact human health and how protein structural ensembles arise and change upon mutation.\nA list of my publications can be found here.\nBackground: Individually occurring clinical variants are too rare for statistical prediction Up to 40% of tumor diagnoses encounter therapeutic resistance in some form, spanning treatment insensitivity to compensatory mechanisms and more. Modern clinical genomics and precision oncology approaches, pairing optimally effective inhibitors with specific tumor profiles, have helped us link mutations to cancer therapy resistance.\nHowever, across many sequencing efforts a common phenomena emerges: Individually occurring clinical variants are too infrequent to statistically infer their impact on a tumor. In other words, many mutations occur too rarely to know whether the mutation is activating, directly impacts therapy resistance and sensitivity, or has no impact.\nMy research focuses on bridging this gap using biophysics to provide mechanistic information describing clinically observed variants. In doing so, I want to build towards physics-based biomarker identification that will enableus to efficiently identify the appropriate treatment for a patient that may have a drug-resistant mutation.\nStructure-based biophysical models promise to help predict the impact of mutations on protein function, as considering the ensemble of structures a protein adopts can provide the necessary mechanistic insight to assess the impact of mutations on function.\nI approach this problem at three levels:\n1. Parse molecular mechanisms of treatment resistance, susceptibility, and selectivity upon mutation (AKA What is the mechanism through which mutations cause treatment resistance?)\nA clinical mutation may induce resistance by directly decreasing drug binding affinity, increasing protein activity, alter signaling pathways by perturbing protein-protein interactions, or retuning a target’s inhibitor sensitivity profile. I combine computation and experimental approaches to study mutation-induced mechanisms through which small-molecule inhibitor resistance may arise. This enables me to build towards models of ligand resistance, susceptibility, and selectivity.\nFor example: We can study the impact of mutations on ligand binding using Alchemical Free Energy calculations:\n2. Predict how protein mutations alter conformational ensembles using physics-based models (AKA How do protein mutations alter conformational states, populations, and transitions?)\nMutation-induced therapy resistance is driven by changes in the conformational ensemble a protein adopts. To mechanistically model the impact of mutations on protein function, activity, and therapeutic resistance, I leverage long timescale molecular dynamics in conjunction with biophysical experimentation to study how mutations may directly impact protein ensembles.\nUsing these tools, I seek to build models that annotate the impact of mutations on protein ensembles, and bridge the gap between biophysical modeling and phenotypic observations. This builds upon my PhD dissertation work studying mechanisms of coupling between distal regions of a protein structure (AKA allostery), which allowed us to characterize coupled events in protein activation:\nBridging these tools with known targets, we can capture how clinical mutants shift ensembles to induce resistance, as I did so studying resistance in a Leukemia target:\n3. Using distributed computing and ML-based approaches to efficiently generate and evaluate datasets describing protein ensembles (AKA How can we efficiently generate and study ensembles of protein variants?)\nUnderlying my research is the need to be able to generate, analyze, and interpret protein conformational ensembles. To even collect sufficient data for ensembles can take a long time on a single GPU:\nTo generate these ensembles, I use long-timescale molecular simulations enabled by the Folding@home platform to generate millisecond-timescale (millions of frames) datasets of kinases and their variants.\nHowever, generating these ensembles using distributed computing is often not sufficient compute, nor is it the more efficient use of GPU-hours. In fact, collecting milliecond-timescale simulations of kinases may not be sufficient to sample the complete set of functional kinase states.\nLeveraging insights from AlphaFold and other ML-based approaches, I seek to identify principled, unbiased approaches that enable efficient exploration of the conformational landscape of many protein variants.","background-individually-occurring-clinical-variants-are-too-rare-for-statistical-prediction#Background: Individually occurring clinical variants are too rare for statistical prediction":"","building-towards-physics-based-biomarker-identification#Building towards physics-based biomarker identification":""},"title":"_index"},"/research/publications/":{"data":{"my-publications#My publications":"My publicationsMy bibliography is embedded below using Bibase. Click on each year to see the relevant publications.\nFeel free to also check out my Google Scholar profile (below) for a more up-to-date list of publications.\nGo to my Google Scholar "},"title":"My Publications"},"/side-projects/":{"data":{"":"Sometimes I like to tinker with a variety of different things. Compiled here are some of those efforts, some of which are embedded: My thesis in HTML My beverage rating map Interactive Traj Viewer D\u0026D 5e Bestiary and NPC database D\u0026D 5e Spell Compendium If you’d prefer to go to the static HTML pages, follow these links here:\nThesis Project bevmap Molview D\u0026D 5e Bestiary and NPC database D\u0026D 5e Grimoire Spellbook "},"title":"Side projects"},"/side-projects/bevmap/":{"data":{"":" Embedded Page Example "},"title":"Beverage map"},"/side-projects/molview/":{"data":{"minimal_molview-visualizations#Minimal_molview Visualizations":"","other-interactive-visualizations#Other interactive visualizations":" Menin + Revumenib ligand Abl kinase DFG-flip Abl kinase DFG-flip with spheres ","sample-visualization-a-kinase-undergoing-a-dfg-flip#Sample Visualization: A kinase undergoing a \u0026ldquo;DFG-flip\u0026rdquo;":"Minimal_molview VisualizationsThis page contains links to visualizations created using Minimal_molview Contributions are welcome!\nClick on the links to view the visualizations in a new tab. A sample visualization is below.\nSample Visualization: A kinase undergoing a “DFG-flip” Give it a moment to load. Use your cursor to click and drag to rotate the molecule."},"title":"MolView - online molecular viewer"},"/side-projects/thesis/":{"data":{"":" Embedded Page Example "},"title":"My thesis project online"}}